In [446]:
import pandas as pd
import numpy as np

In [447]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [448]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [449]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD")) #Indices son las fechas
df                                                                          #Nombre de columnas 'A', 'B', 'C', 'D'

                   A         B         C         D
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014
2013-01-02 -0.313109  0.570409 -0.455801  0.707434
2013-01-03  0.008970 -1.006559  0.104892 -0.777635
2013-01-04 -0.247744 -0.210240  1.385401  1.754932
2013-01-05  1.354854 -0.053630  1.028748  1.187780
2013-01-06 -0.820252  0.141758  0.972981 -1.218968

In [450]:
df2 = pd.DataFrame( #En diccionario, el indice es la columna y lo demas los datos
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [451]:
df2.dtypes #Tipos de datos

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [452]:
df.index #Indices del Df

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [453]:
df.columns #Columnas

Index(['A', 'B', 'C', 'D'], dtype='object')

In [454]:
df.to_numpy() #Df a arreglo de numpy

array([[-1.13597147, -0.21294895,  0.59976793, -1.26101439],
       [-0.31310915,  0.57040949, -0.45580094,  0.70743422],
       [ 0.00897008, -1.00655927,  0.10489243, -0.77763471],
       [-0.2477442 , -0.21024024,  1.38540119,  1.75493193],
       [ 1.35485368, -0.05363018,  1.02874788,  1.18778033],
       [-0.82025153,  0.14175796,  0.97298069, -1.21896814]])

In [455]:
df2.to_numpy() #Busca el tipo de dato que mejor se acomode a todos los datos

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [456]:
df.describe() #Descripcion

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.192209 -0.128535  0.605998  0.065422
std    0.864489  0.519985  0.678148  1.315002
min   -1.135971 -1.006559 -0.455801 -1.261014
25%   -0.693466 -0.212272  0.228611 -1.108635
50%   -0.280427 -0.131935  0.786374 -0.035100
75%   -0.055208  0.092911  1.014806  1.067694
max    1.354854  0.570409  1.385401  1.754932

In [457]:
df

                   A         B         C         D
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014
2013-01-02 -0.313109  0.570409 -0.455801  0.707434
2013-01-03  0.008970 -1.006559  0.104892 -0.777635
2013-01-04 -0.247744 -0.210240  1.385401  1.754932
2013-01-05  1.354854 -0.053630  1.028748  1.187780
2013-01-06 -0.820252  0.141758  0.972981 -1.218968

In [458]:
df.T #Transpuesta

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.135971   -0.313109    0.008970   -0.247744    1.354854   -0.820252
B   -0.212949    0.570409   -1.006559   -0.210240   -0.053630    0.141758
C    0.599768   -0.455801    0.104892    1.385401    1.028748    0.972981
D   -1.261014    0.707434   -0.777635    1.754932    1.187780   -1.218968

In [459]:
df.sort_index(axis=1, ascending=False) #Ordenar las columnas

                   D         C         B         A
2013-01-01 -1.261014  0.599768 -0.212949 -1.135971
2013-01-02  0.707434 -0.455801  0.570409 -0.313109
2013-01-03 -0.777635  0.104892 -1.006559  0.008970
2013-01-04  1.754932  1.385401 -0.210240 -0.247744
2013-01-05  1.187780  1.028748 -0.053630  1.354854
2013-01-06 -1.218968  0.972981  0.141758 -0.820252

In [460]:
df.sort_values(by="B", ascending=False) #Ordenar la columna B del mas grande al mas pequeno

                   A         B         C         D
2013-01-02 -0.313109  0.570409 -0.455801  0.707434
2013-01-06 -0.820252  0.141758  0.972981 -1.218968
2013-01-05  1.354854 -0.053630  1.028748  1.187780
2013-01-04 -0.247744 -0.210240  1.385401  1.754932
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014
2013-01-03  0.008970 -1.006559  0.104892 -0.777635

In [461]:
df["A"] #Solo una columna

2013-01-01   -1.135971
2013-01-02   -0.313109
2013-01-03    0.008970
2013-01-04   -0.247744
2013-01-05    1.354854
2013-01-06   -0.820252
Freq: D, Name: A, dtype: float64

In [462]:
df[0:3] #Fila de la 0 a la 2

                   A         B         C         D
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014
2013-01-02 -0.313109  0.570409 -0.455801  0.707434
2013-01-03  0.008970 -1.006559  0.104892 -0.777635

In [463]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.313109  0.570409 -0.455801  0.707434
2013-01-03  0.008970 -1.006559  0.104892 -0.777635
2013-01-04 -0.247744 -0.210240  1.385401  1.754932

In [464]:
df.loc[dates[0]] #Buscar de las columnas, cuando la fecha esta en posicion 0

A   -1.135971
B   -0.212949
C    0.599768
D   -1.261014
Name: 2013-01-01 00:00:00, dtype: float64

In [465]:
df.loc[:, ["A", "B"]] #Todo de las columnas "A" y "B"

                   A         B
2013-01-01 -1.135971 -0.212949
2013-01-02 -0.313109  0.570409
2013-01-03  0.008970 -1.006559
2013-01-04 -0.247744 -0.210240
2013-01-05  1.354854 -0.053630
2013-01-06 -0.820252  0.141758

In [466]:
df.loc["20130102":"20130104", ["A", "B"]] #Range especifico y columnas especificas

                   A         B
2013-01-02 -0.313109  0.570409
2013-01-03  0.008970 -1.006559
2013-01-04 -0.247744 -0.210240

In [467]:
df.loc[dates[0], "A"] #Un indice, una columna

-1.135971469958609

In [468]:
df.iloc[3] #Iloc es con numeros y loc con palabras

A   -0.247744
B   -0.210240
C    1.385401
D    1.754932
Name: 2013-01-04 00:00:00, dtype: float64

In [469]:
df.iloc[3:5, 0:2]

                   A        B
2013-01-04 -0.247744 -0.21024
2013-01-05  1.354854 -0.05363

In [470]:
df.iloc[[1, 2, 4], [0, 2]] #Filas y columnas especificas

                   A         C
2013-01-02 -0.313109 -0.455801
2013-01-03  0.008970  0.104892
2013-01-05  1.354854  1.028748

In [471]:
df.iloc[1, 1] #Valor especifico posicion 1, 1

0.5704094851096302

In [472]:
df[df["A"] > 0] #Seleccionar registros especificos

                   A         B         C         D
2013-01-03  0.008970 -1.006559  0.104892 -0.777635
2013-01-05  1.354854 -0.053630  1.028748  1.187780

In [473]:
df[df > 0] #De todo el Df, NAN a los que no cumplen

                   A         B         C         D
2013-01-01       NaN       NaN  0.599768       NaN
2013-01-02       NaN  0.570409       NaN  0.707434
2013-01-03  0.008970       NaN  0.104892       NaN
2013-01-04       NaN       NaN  1.385401  1.754932
2013-01-05  1.354854       NaN  1.028748  1.187780
2013-01-06       NaN  0.141758  0.972981       NaN

In [474]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014    one
2013-01-02 -0.313109  0.570409 -0.455801  0.707434    one
2013-01-03  0.008970 -1.006559  0.104892 -0.777635    two
2013-01-04 -0.247744 -0.210240  1.385401  1.754932  three
2013-01-05  1.354854 -0.053630  1.028748  1.187780   four
2013-01-06 -0.820252  0.141758  0.972981 -1.218968  three

In [475]:
df2[df2["E"].isin(["two", "four"])]
#Imprimir los registros donde en 'E' contengan "two" y "four"

                   A         B         C         D     E
2013-01-03  0.008970 -1.006559  0.104892 -0.777635   two
2013-01-05  1.354854 -0.053630  1.028748  1.187780  four

In [476]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130101", periods=6))
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [477]:
df["F"] = s1
df

                   A         B         C         D  F
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014  1
2013-01-02 -0.313109  0.570409 -0.455801  0.707434  2
2013-01-03  0.008970 -1.006559  0.104892 -0.777635  3
2013-01-04 -0.247744 -0.210240  1.385401  1.754932  4
2013-01-05  1.354854 -0.053630  1.028748  1.187780  5
2013-01-06 -0.820252  0.141758  0.972981 -1.218968  6

In [478]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C         D  F    E
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014  1  1.0
2013-01-02 -0.313109  0.570409 -0.455801  0.707434  2  1.0
2013-01-03  0.008970 -1.006559  0.104892 -0.777635  3  NaN
2013-01-04 -0.247744 -0.210240  1.385401  1.754932  4  NaN

In [479]:
df1.dropna(how='any') #Eliminar registros con Nan

                   A         B         C         D  F    E
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014  1  1.0
2013-01-02 -0.313109  0.570409 -0.455801  0.707434  2  1.0

In [480]:
df1.fillna(value=5) #Llenar Nan con valor especifico

                   A         B         C         D  F    E
2013-01-01 -1.135971 -0.212949  0.599768 -1.261014  1  1.0
2013-01-02 -0.313109  0.570409 -0.455801  0.707434  2  1.0
2013-01-03  0.008970 -1.006559  0.104892 -0.777635  3  5.0
2013-01-04 -0.247744 -0.210240  1.385401  1.754932  4  5.0

In [481]:
pd.isna(df1) #Ver que valores son Nan en el Df

                A      B      C      D      F      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [482]:
df.mean(axis=0) #Media para cada columna

A   -0.192209
B   -0.128535
C    0.605998
D    0.065422
F    3.500000
dtype: float64

In [483]:
df.mean(axis=1) #Media para cada fila

2013-01-01   -0.202033
2013-01-02    0.501787
2013-01-03    0.265934
2013-01-04    1.336470
2013-01-05    1.703550
2013-01-06    1.015104
Freq: D, dtype: float64

In [484]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2) #Recorrer dos lugares los datos
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [485]:
df.sub(s, axis="index")

                   A         B         C         D    F
2013-01-01       NaN       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN       NaN  NaN
2013-01-03 -0.991030 -2.006559 -0.895108 -1.777635  2.0
2013-01-04 -3.247744 -3.210240 -1.614599 -1.245068  1.0
2013-01-05 -3.645146 -5.053630 -3.971252 -3.812220  0.0
2013-01-06       NaN       NaN       NaN       NaN  NaN

In [486]:
df.apply(lambda x: np.mean(x) * 5.6, axis=0) #Scara la media a lo largo de las columnas

A    -1.076369
B    -0.719797
C     3.393590
D     0.366361
F    19.600000
dtype: float64

In [487]:
df.transform(lambda x: x * 101.2) #Multiplicar todos los datos por 101.2

                     A           B           C           D      F
2013-01-01 -114.960313  -21.550434   60.696515 -127.614656  101.2
2013-01-02  -31.686646   57.725440  -46.127055   71.592343  202.4
2013-01-03    0.907772 -101.863798   10.615114  -78.696633  303.6
2013-01-04  -25.071713  -21.276312  140.202601  177.599111  404.8
2013-01-05  137.111193   -5.427374  104.109286  120.203370  506.0
2013-01-06  -83.009455   14.345906   98.465646 -123.359575  607.2

In [488]:
s = pd.Series(np.random.randint(0, 7, size=10)) #Contar valores
s.value_counts()

0    3
2    2
3    2
5    1
4    1
6    1
Name: count, dtype: int64

In [489]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [490]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.382156  0.028421  0.828489 -1.048215
1 -0.291116  0.980506  0.559656  0.108461
2 -0.771935 -0.299868  0.071847  0.145883
3 -0.077567 -0.871409 -0.614993  1.591244
4 -0.155477 -0.196496  0.334029  0.198485
5  0.040335  0.098713  0.202141 -1.247522
6 -0.370301  0.651266 -0.992597 -0.350948
7 -2.120962 -0.510664 -1.030643 -1.644162
8 -0.816186  1.889543 -0.522147  1.322115
9 -0.754394 -0.533242 -1.219348 -0.599389

In [491]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.382156  0.028421  0.828489 -1.048215
 1 -0.291116  0.980506  0.559656  0.108461
 2 -0.771935 -0.299868  0.071847  0.145883,
           0         1         2         3
 3 -0.077567 -0.871409 -0.614993  1.591244
 4 -0.155477 -0.196496  0.334029  0.198485
 5  0.040335  0.098713  0.202141 -1.247522
 6 -0.370301  0.651266 -0.992597 -0.350948,
           0         1         2         3
 7 -2.120962 -0.510664 -1.030643 -1.644162
 8 -0.816186  1.889543 -0.522147  1.322115
 9 -0.754394 -0.533242 -1.219348 -0.599389]

In [492]:
pd.concat(pieces, axis=0) #Concatenar

          0         1         2         3
0  0.382156  0.028421  0.828489 -1.048215
1 -0.291116  0.980506  0.559656  0.108461
2 -0.771935 -0.299868  0.071847  0.145883
3 -0.077567 -0.871409 -0.614993  1.591244
4 -0.155477 -0.196496  0.334029  0.198485
5  0.040335  0.098713  0.202141 -1.247522
6 -0.370301  0.651266 -0.992597 -0.350948
7 -2.120962 -0.510664 -1.030643 -1.644162
8 -0.816186  1.889543 -0.522147  1.322115
9 -0.754394 -0.533242 -1.219348 -0.599389

In [493]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [494]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [495]:
pd.merge(left, right, on="key") #Juntar dos Df con mismas llaves

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [496]:
np.random.seed(45)

df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  0.026375  0.394073
1  bar    one  0.260322  0.935106
2  foo    two -0.395146 -0.015685
3  bar  three -0.204301  0.259596
4  foo    two -1.271633 -1.473314
5  bar    two -2.596879  0.801927
6  foo    one  0.289681 -1.750752
7  foo  three -0.873305 -0.495052

In [497]:
df.groupby("A")[["C", "D"]].sum() #Group by "A" y sumar columna "C" y "D"

            C         D
A
bar -2.540858  1.996628
foo -2.224027 -3.340731

In [498]:
df.groupby(["A", "B"]).sum() #Group by multiIndice

                  C         D
A   B
bar one    0.260322  0.935106
    three -0.204301  0.259596
    two   -2.596879  0.801927
foo one    0.316056 -1.356680
    three -0.873305 -0.495052
    two   -1.666778 -1.488999

In [499]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]

index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [500]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"]) #MultiIndice
df

                     A         B
first second
bar   one    -1.008601  0.025244
      two    -0.121507 -1.546873
baz   one    -0.606944 -1.393813
      two    -0.627695  0.332632
foo   one    -1.541367  1.670300
      two    -0.499546  0.673129
qux   one     2.248090 -1.654263
      two    -0.474397 -0.301915

In [501]:
df2=df[:4]
df2

                     A         B
first second
bar   one    -1.008601  0.025244
      two    -0.121507 -1.546873
baz   one    -0.606944 -1.393813
      two    -0.627695  0.332632

In [502]:
stacked = df2.stack(future_stack=True)
pd.DataFrame(stacked) #Crear mas subcategorias

                       0
first second
bar   one    A -1.008601
             B  0.025244
      two    A -0.121507
             B -1.546873
baz   one    A -0.606944
             B -1.393813
      two    A -0.627695
             B  0.332632

In [503]:
stacked.unstack() #Deshacer el stack

                     A         B
first second
bar   one    -1.008601  0.025244
      two    -0.121507 -1.546873
baz   one    -0.606944 -1.393813
      two    -0.627695  0.332632

In [504]:
stacked.unstack(1) #Poner la segunda subclase como Unstacked

second        one       two
first
bar   A -1.008601 -0.121507
      B  0.025244 -1.546873
baz   A -0.606944 -0.627695
      B -1.393813  0.332632

In [505]:
stacked.unstack(0) #Ahora la primera subclase pasa a columna

first          bar       baz
second
one    A -1.008601 -0.606944
       B  0.025244 -1.393813
two    A -0.121507 -0.627695
       B -1.546873  0.332632

In [506]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

df

        A  B    C         D         E
0     one  A  foo -0.931026 -0.655704
1     one  B  foo  1.110986 -0.146883
2     two  C  foo -0.189683 -1.411976
3   three  A  bar  1.278410 -0.270557
4     one  B  bar -0.554077  1.129303
5     one  C  bar  0.354303 -1.340258
6     two  A  foo -0.440276 -0.249296
7   three  B  foo -0.424449  1.763492
8     one  C  foo  0.228082 -0.591959
9     one  A  bar  0.579044 -0.907812
10    two  B  bar -0.854188  0.271800
11  three  C  bar -0.841340 -0.004562

In [507]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"]) #Pivotear la tabla

C             bar       foo
A     B
one   A  0.579044 -0.931026
      B -0.554077  1.110986
      C  0.354303  0.228082
three A  1.278410       NaN
      B       NaN -0.424449
      C -0.841340       NaN
two   A       NaN -0.440276
      B -0.854188       NaN
      C       NaN -0.189683

In [508]:
#Series de tiempo
rng = pd.date_range("1/1/2012", periods=100, freq="s")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample('5min').sum()

2012-01-01    24237
Freq: 5min, dtype: int32

In [509]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)),index= rng)
ts

2012-03-06    0.097142
2012-03-07    1.260992
2012-03-08    1.298708
2012-03-09   -1.436939
2012-03-10   -0.859473
Freq: D, dtype: float64

In [510]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00    0.097142
2012-03-07 00:00:00+00:00    1.260992
2012-03-08 00:00:00+00:00    1.298708
2012-03-09 00:00:00+00:00   -1.436939
2012-03-10 00:00:00+00:00   -0.859473
Freq: D, dtype: float64

In [511]:
ts_utc.tz_convert("US/Eastern") #Lo convierte a una hora

2012-03-05 19:00:00-05:00    0.097142
2012-03-06 19:00:00-05:00    1.260992
2012-03-07 19:00:00-05:00    1.298708
2012-03-08 19:00:00-05:00   -1.436939
2012-03-09 19:00:00-05:00   -0.859473
Freq: D, dtype: float64

In [512]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [513]:
rng
rng + pd.offsets.BusinessDay(5) #No incluye fines de semana

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)

In [514]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [515]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [516]:
new_categories = ["very good", "good", "very bad"]
df["grade"] = df["grade"].cat.rename_categories(new_categories) #Renombrar categorias

In [517]:
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): ['very good', 'good', 'very bad']

In [518]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [519]:
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [520]:
df.sort_values(by="grade") #Ordenar por categoria pero de la primera categoria escrita a la ultima

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [521]:
df.groupby("grade", observed=False).size() #Ordenados por categoria

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [522]:
df['grade'].value_counts()

grade
very good    3
good         2
very bad     1
bad          0
medium       0
Name: count, dtype: int64